OpenFOAM-3.0.1/chapter6/heatedCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 50;

boundaryField
{
    movingWall
    {
        type            fixedValue;
	value		uniform 50;
    }

    fixedWalls
    {
        type            fixedValue;
	value		uniform 75;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
